package com.bootdo.contentprohibited.domain;

/**
 * @description: 默认错误
 * @auther: CoffeeN
 * @date: 2018/12/10 18:25
 */
public enum ErrorCode {

	// 正确
	SUCCEED("200", "成功"),

	// 文件服务异常
	FS_001("fs.0001", "远程文件服务异常"),

	// domainCode不能为空
	DOC_0001("doc.0001", "domainCode不能为空"),
	// authToken不能为空
	DOC_0002("doc.0002", "authToken不能为空"),
	// bucketName不能为空
	DOC_0003("doc.0003", "bucketName不能为空"),
	// 文件夹名称不能为空
	DOC_0004("doc.0004", "文件夹名称不能为空"),
	// 文件是必须项
	DOC_0005("doc.0005", "文件是必须项"),
	// objectKey是必须项
	DOC_0006("doc.0006", "objectKey是必须项"),
	// 桶类型是必须项
	DOC_0007("doc.0007", "桶类型是必须项"),
	// 桶权限是必须项
	DOC_0008("doc.0008", "桶权限是必须项"),

	// 系统异常，请联系管理员
	SYS_0001("sys.0001", "系统异常，请联系管理员"),
	// 授权无效
	SYS_0002("sys.0002", "授权无效"),
	// 用户未绑定
	SYS_0003("sys.0003", "用户未绑定"),
	// 非管理员用户
	SYS_0004("sys.0004", "非管理员用户"),
	// 当前用户已被禁言
	SYS_0005("sys.0005", "当前用户已被禁言"),

	// 页码需大于等于1
	PAGE_0001("page.0001", "页码需大于等于1"),
	// 每页显示数量需大于等于1
	PAGE_0002("page.0002", "每页显示数量需大于等于1"),
	// 分页查询异常
	PAGE_0003("page.0003", "分页查询异常"),

	// 用户标识不能为空
	USER_0001("user.0001", "用户标识不能为空"),
	// 当前用户无此权限
	USER_0002("user.0002", "当前用户无此权限"),
	//OpenID标识无效
	USER_0003("user.0003", "OpenID标识无效"),
	// 当前操作人标识为空
	USER_0004("user.0004", "当前操作人标识为空"),
	// 当前用户绑定手机号码不能为空
	USER_0005("user.0005", "当前用户绑定手机号码不能为空"),
	// 当前用户绑定手机号码格式错误
	USER_0006("user.0006", "当前用户绑定手机号码格式错误"),
	// 用户绑定失败
	USER_0007("user.0007", "用户绑定失败"),
	// 用户绑定异常
	USER_0008("user.0008", "用户绑定异常"),
	// 当前操作用户未绑定
	USER_0009("user.0009", "当前操作用户未绑定"),
	// 添加禁言用户失败
	USER_0010("user.0010", "添加禁言用户失败"),
	// 取消禁言用户失败
	USER_0011("user.0011", "取消禁言用户失败"),
	// 添加禁言用户异常
	USER_0012("user.0012", "添加禁言用户异常"),
	// 取消禁言用户异常
	USER_0013("user.0013", "取消禁言用户异常"),
	// 查询用户是否被禁言异常
	USER_0014("user.0014", "查询用户是否被禁言异常"),
	// UnionId标识无效
	USER_0015("user.0014", "UnionId标识无效"),

	// 添加管理员失败
	ADMIN_0001("admin.0001", "添加管理员失败"),
	// 添加管理员异常
	ADMIN_0002("admin.0002", "添加管理员异常"),
	// 删除管理员失败
	ADMIN_0003("admin.0003", "删除管理员失败"),
	// 删除管理员异常
	ADMIN_0004("admin.0004", "删除管理员异常"),
	// 查询是否是有效管理员异常
	ADMIN_0005("admin.0005", "查询是否是有效管理员异常"),

	// 违禁词集合不能为空
	PROHIBITED_0001("prohibited.0001", "违禁词集合不能为空"),
	// 违禁词集合标识集合不能为空
	PROHIBITED_0002("prohibited.0002", "违禁词集合标识集合不能为空"),
	// 违禁词已存在
	PROHIBITED_0003("prohibited.0003", "违禁词已存在"),

	// ------------------- 论坛中帖子信息异常 -------------------
	// 帖子标题不能为空
	BBS_0001("bbs.0001", "帖子标题不能为空"),
	// 帖子标题长度应在1-30之间
	BBS_0002("bbs.0002", "帖子标题长度应在1-30之间"),
	// 帖子内容不能为空
	BBS_0003("bbs.0003", "帖子内容不能为空"),
	// 帖子内容长度应在1-1500之间
	BBS_0004("bbs.0004", "帖子内容长度应在1-1500之间"),
	// 帖子添加失败
	BBS_0005("bbs.0005", "帖子添加失败"),
	// 帖子内容添加失败
	BBS_0006("bbs.0006", "帖子内容添加失败"),
	// 用户添加帖子其他异常
	BBS_0007("bbs.0007", "用户添加帖子其他异常"),
	// 帖子标识不能为空
	BBS_0008("bbs.0008", "帖子标识不能为空"),
	// 用户删除帖子失败
	BBS_0009("bbs.0009", "用户删除帖子失败"),
	// 用户删除帖子异常
	BBS_0010("bbs.0010", "用户删除帖子异常"),
	// 批量删除帖子失败
	BBS_0011("bbs.0011", "批量删除帖子失败"),
	// 批量删除帖子异常
	BBS_0012("bbs.0012", "批量删除帖子异常"),
	// 帖子递增收藏数量失败
	BBS_0013("bbs.0013", "帖子递增收藏数量失败"),
	// 帖子添加收藏异常
	BBS_0014("bbs.0014", "帖子添加收藏异常"),
	// 帖子取消收藏异常
	BBS_0015("bbs.0015", "帖子取消收藏异常"),
	// 帖子添加点赞失败
	BBS_0016("bbs.0016", "帖子添加点赞失败"),
	// 帖子取消点赞失败
	BBS_0017("bbs.0017", "帖子取消点赞失败"),
	// 帖子递增点赞数量失败
	BBS_0018("bbs.0018", "帖子递增点赞数量失败"),
	// 帖子添加点赞异常
	BBS_0019("bbs.0019", "帖子添加点赞异常"),
	// 帖子取消点赞异常
	BBS_0020("bbs.0020", "帖子取消点赞异常"),
	// 帖子添加阅读失败
	BBS_0021("bbs.0021", "帖子添加阅读失败"),
	// 帖子添加阅读异常
	BBS_0022("bbs.0022", "帖子添加阅读异常"),
	// 帖子批量审核失败
	BBS_0023("bbs.0023", "帖子批量审核失败"),
	// 帖子批量审核异常
	BBS_0024("bbs.0024", "帖子批量审核异常"),
	// 帖子批量驳回异常
	BBS_0025("bbs.0025", "帖子批量驳回异常"),
	// 驳回原因不能为空
	BBS_0026("bbs.0026", "驳回原因不能为空"),
	// 批量热帖操作失败
	BBS_0027("bbs.0027", "批量热帖操作失败"),
	// 批量置热帖操作异常
	BBS_0028("bbs.0028", "批量置热帖操作异常"),
	// 批量取消热帖操作异常
	BBS_0029("bbs.0029", "批量取消热帖操作异常"),
	// BBS_0030
	BBS_0030("bbs.0030", "帖子与当前操作用户不匹配"),
	// 帖子搜索内容长度应在1-30个字符之间
	BBS_0031("bbs.0031", "帖子搜索内容长度应在1-30个字符之间"),
	// 输入搜索内容包含违禁词
	BBS_0032("bbs.0032", "输入搜索内容包含违禁词"),
	// 输入帖子标题包含违禁词
	BBS_0033("bbs.0033", "输入帖子标题包含违禁词"),
	// 输入帖子内容包含违禁词
	BBS_0034("bbs.0034", "输入帖子内容包含违禁词"),

	// 帖子图片不能为空
	BBS_0035("bbs.0035", "帖子图片不能为空"),
	// 帖子图片处理失败
	BBS_0036("bbs.0036", "帖子图片处理失败"),

	BBS_0037("bbs.0037", "帖子无效"),

	BBS_0038("bbs.0038", "帖子摘要不能为空"),

	BBS_0039("bbs.0038", "文件服务返回图片URL为空"),

	BBS_0040("bbs.0040", "帖子类型不能为空"),

	// ------------------- 论坛中评论信息异常 -------------------

	BBSC_0001("bbsc.0001", "评论内容不能为空"),
	BBSC_0002("bbsc.0002", "评论内容长度应在1-200之间"),
	BBSC_0003("bbsc.0003", "评论插入异常"),
	BBSC_0004("bbsc.0004", "评论删除异常"),
	BBSC_0005("bbsc.0005", "评论更新异常"),
	BBSC_0006("bbsc.0006", "评论查询异常"),
	BBSC_0007("bbsc.0007", "评论插入失败"),
	BBSC_0008("bbsc.0008", "评论删除失败"),
	BBSC_0009("bbsc.0009", "评论更新失败"),
	BBSC_0010("bbsc.0010", "帖子ID不能为空"),
	BBSC_0011("bbsc.0011", "用户ID不能为空"),
	BBSC_0012("bbsc.0012", "评论ID不能为空"),
	BBSC_0013("bbsc.0013", "不通过原因不能为空"),
	BBSC_0014("bbsc.0014", "只有作者才可删除自己的评论"),
	BBSC_0015("bbsc.0015", "只能操作未审核状态的评论"),
	BBSC_0016("bbsc.0016", "回复内容不能为空"),
	BBSC_0017("bbsc.0017", "回复内容长度应在1-200之间"),
	BBSC_0018("bbsc.0018", "回复ID列表不能为空"),
	BBSC_0019("bbsc.0019", "回复插入异常"),
	BBSC_0020("bbsc.0020", "回复删除异常"),
	BBSC_0021("bbsc.0021", "回复更新异常"),
	BBSC_0022("bbsc.0022", "回复插入失败"),
	BBSC_0023("bbsc.0023", "回复删除失败"),
	BBSC_0024("bbsc.0024", "回复更新失败"),
	BBSC_0025("bbsc.0025", "只有作者才可删除自己的回复"),
	BBSC_0026("bbsc.0026", "只能操作未审核状态的回复"),
	BBSC_0027("bbsc.0027", "无法操作"),
	//轮播图异常
	BANNER_0001("banner.0001", "轮播图ID不能为空"),
	BANNER_0002("banner.0002", "轮播图地址不能为空"),
	BANNER_0003("banner.0003", "访问地址不能为空"),
	BANNER_0004("banner.0004", "轮播图保存失败"),
	BANNER_0005("banner.0005", "轮播图保存异常"),
	BANNER_0006("banner.0006", "轮播已被其他人删除"),
	BANNER_0007("banner.0007", "轮播图删除异常"),
	BANNER_0008("banner.0008", "地址长度应在1-255之间"),
	BANNER_0009("banner.0009", "轮播列表ID不能为空"),
	;
	// ------------------- 论坛中帖子信息异常 -------------------

	private String code;
	private String message;

	ErrorCode(String code, String message) {
		this.code = code;
		this.message = message;
	}

	public String getCode() {
		return this.code;
	}

	public String getMessage() {
		return this.message;
	}

}
